// --------  1 - Привет, мир!

// Для добавления кода JavaScript на страницу используется тег <script>
// Атрибуты type и language необязательны.
// Скрипт во внешнем файле можно вставить с помощью <script src="path/to/script.js"></script>.


// --------  2 - Переменные
// 2.1 Работа с переменными
// let admin;
// let name;
// name = 'John';
// admin = name;
// alert(admin);
// 2.2 Придумайте правильные имена
// Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// let = ourPlanetName;
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
// let = currentUserName;
// // 2.3 Какие буквы (заглавные или строчные) использовать для имён констант?
// const birthday = '18.04.1982';
// можно BIRTHDAY но не AGE
// const age = someCode(birthday);


// --------  3 - Шаблонные строки
// 3.1 Работа с переменными
// let name = "Ilya";
// alert( `hello ${1}` ); // hello 1
// alert( `hello ${"name"}` ); // hello name
// alert( `hello ${name}` ); // hello Ilya

// --------  4 - Взаимодействие: alert, prompt, confirm
// 4.1 Простая страница
// Создайте страницу, которая спрашивает имя у пользователя и выводит его.
// alert( `Your name is ${prompt('What is your name?', '')}`);

// --------  5 - Базовые операторы, математика
// 5.1 Постфиксная и префиксная формы
// Чему будут равны переменные a, b, c и d в примере ниже?
// let a = 1, b = 1;
// let c = ++a; // 2
// let d = b++; // 1


// --------  6
// --------  7
// --------  8
// --------  9
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
// --------  10
