// --------  1 - Привет, мир!

// Для добавления кода JavaScript на страницу используется тег <script>
// Атрибуты type и language необязательны.
// Скрипт во внешнем файле можно вставить с помощью <script src="path/to/script.js"></script>.


// --------  2 - Переменные
// 2.1 Работа с переменными
// let admin;
// let name;
// name = 'John';
// admin = name;
// alert(admin);
// 2.2 Придумайте правильные имена
// Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// let = ourPlanetName;
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
// let = currentUserName;
// // 2.3 Какие буквы (заглавные или строчные) использовать для имён констант?
// const birthday = '18.04.1982';
// можно BIRTHDAY но не AGE
// const age = someCode(birthday);